OSPF Configuration
R1 -> en
  R1(config)# line vty 0 4
              password admin
              login
              en
              router ospf 1
  R1(config-router)# network 192.168.1.0 0.0.0.255 area 0
                     network 10.1.1.0 0.0.0.255 area 0

R2 -> en
  R2(config)# line vty 0 4
              password admin
              login
              en
              router ospf 2
  R2(config-router)# network 192.168.2.0 0.0.0.255 area 0
                     network 10.1.1.0 0.0.0.255 area 0
                     network 10.2.2.0 0.0.0.255 area 0

R3 -> en
  R3(config)# line vty 0 4
              password admin
              login
              en
              router ospf 3
  R3(config-router)# network 192.168.3.0 0.0.0.255 area 0
                     network 10.2.2.0 0.0.0.255 area 0


Practical starts


R2 -> en
R2(config)# username Admin2 secret admin2pa55

TACACS Server:
Services -> AAA -> ON -> R2(ClientName) -> 192.168.2.1(ClientIP)
tacacspa55(Secret)  Tacacs(ServerType)

Add: 
Username: Admin2    Password: admin2pa55

in Router 2
R2(config)# aaa new-model
            aaa authentication login default group tacacs+ local
            line console 0
R2(config-line)# login authentication default
                 end
                 exit
